# Финальный проект по SQL

## Информация о проекте

Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать.

Ваша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Ваша первая задача как аналитика — проанализировать базу данных.
В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

## План действий

### Задания

- Посчитайте, сколько книг вышло после 1 января 2000 года;
- Для каждой книги посчитайте количество обзоров и среднюю оценку;
- Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;
- Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;
- Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

### Как выполнить задание?

- Опишите цели исследования;
- Исследуйте таблицы — выведите первые строки;
- Сделайте по одному SQL-запросу для решения каждого задания;
- Выведите результат каждого запроса в тетрадке;
- Опишите выводы по каждой из решённых задач.

## Описание данных

**Таблица `books`**

Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`**

Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`**

Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`**

Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`**

Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

## Предобработка данных

### Импортирование библиотек и вывод данных

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import text, create_engine

# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

# чтобы выполнить SQL-запрос, используем Pandas
query = '''SELECT * FROM books LIMIT 5'''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [2]:
query = '''SELECT * FROM authors LIMIT 5'''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [3]:
query = '''SELECT * FROM publishers LIMIT 5'''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [4]:
query = '''SELECT * FROM ratings LIMIT 5'''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [5]:
query = '''SELECT * FROM reviews LIMIT 5'''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

## Задания
1. Посчитайте, сколько книг вышло после 1 января 2000 года

In [6]:
query = '''SELECT COUNT(DISTINCT book_id) 
           FROM books 
           WHERE publication_date > '2000-01-01'
        '''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

   count
0    819

Вывод: 819 книг вышло после 1 января 2000 года.

2. Для каждой книги посчитайте количество обзоров и среднюю оценку;

In [7]:
query = ''' SELECT b.title, 
                   SUM(rev_cnt) AS rev_number,
                   AVG(avg_rating) AS avg_rating 
            FROM books b
            LEFT JOIN (SELECT book_id, 
                              COUNT(review_id) AS rev_cnt
                       FROM reviews
                       GROUP BY book_id) AS cnt_1
            ON b.book_id = cnt_1.book_id
            LEFT JOIN (SELECT book_id, 
                              AVG(rating) AS avg_rating
                       FROM ratings
                       GROUP BY book_id) AS cnt_2
            ON b.book_id = cnt_2.book_id
            GROUP BY b.title
        '''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

                                                 title  rev_number  avg_rating
0                            The Count of Monte Cristo         5.0    4.217391
1                              Count Zero (Sprawl  #2)         2.0    2.500000
2    The Botany of Desire: A Plant's-Eye View of th...         2.0    3.500000
3                                 The Poisonwood Bible         5.0    4.363636
4                                 The Canterbury Tales         3.0    3.333333
..                                                 ...         ...         ...
994  In the Heart of the Sea: The Tragedy of the Wh...         3.0    3.333333
995                           Of Love and Other Demons         2.0    4.500000
996               Welcome to Temptation (Dempseys  #1)         2.0    5.000000
997                      World's End (The Sandman  #8)         2.0    4.500000
998                                  Holes (Holes  #1)         5.0    3.967742

[999 rows x 3 columns]

Благодарю за совместную работу и хочу поздравить, ты большой молодец, что прошёл такой путь и освоил программу, надеюсь у тебя сбудутся все намеченные планы.

У Практикума развивается сообщество выпускников, так что рекомендую про него не забывать, в случае необходимости.


Запомнилось, что у тебя и была функция для первичного анализа, что ценно само по себе, так как стремление автоматизировать повторяющиеся задачи полезно и важно для аналитика. Есть библиотека `pandas profiling`, при помощи которой удобно разбираться с первичным анализом. Здорово, что и рекомендации внедряешь в работу, разделители, `parse_dates`, спасибо за взаимодействие и желаю успехов!) 


Оформление презентаций дело субъективное и зачастую в разных компаниях имеются свои требования, но вот видео от Яндекса по созданию презентаций https://www.youtube.com/watch?v=S0r0fMJa9eA, а ещё на платформе практикума открылся бесплатный курс по созданию презентаций, рекомендую.

Для более глубокого изучения tableau, в случае необходимости рекомендую материал https://tableau.pro/m01, этот курс делает классная команда, у них бывают и другие интересные мини курсы. Но в последнее время российские компании уходят от tableau или уже ушли, поэтому возможно придётся познакомиться с другими инструментами.

Задачи на статистику или вокруг неё часто возникают на собеседовании, для укрепления этого фундамента рекомендую статью для выбора критерия проверки гипотез https://lit-review.ru/biostatistika/vybor-statisticheskogo-kriteriya/, https://statpsy.ru/ - информация по критериям проверки гипотез.

Визуализации данных для аналитиков очень важны, при помощи них легче доносить желаемые мысли, а для того, чтобы лучше отобразить, нужно понимать, какие вообще существуют визуализации, делюсь с тобой своей подборкой для разных случае жизни https://www.notion.so/d9392e1cb71f48cfb1fbf7f557a2b7e7 


SQL важный навык, который нужно поддерживать для этого существует много тренажёров:
* Статья на хабр с топ-тренажёрами: https://techrocks.ru/2019/11/22/7-sites-to-perfect-sql-query-writing-skills/
* задачки SQL - https://habr.com/ru/company/dcmiran/blog/500360/
* https://sqlzoo.net/

In [8]:
# рассчитаем число отзвов в изначальной таблице:
query = '''SELECT COUNT(review_id)
           FROM reviews
        '''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

   count
0   2793

In [9]:
total_reviews_query = ''' 
SELECT SUM(rev_cnt) AS total_reviews 
FROM (
            SELECT b.title, 
                   SUM(rev_cnt) AS rev_cnt,
                   AVG(avg_rating)   
            FROM books b
            LEFT JOIN (SELECT book_id, 
                              COUNT(review_id) AS rev_cnt
                       FROM reviews
                       GROUP BY book_id) AS cnt_1
            ON b.book_id = cnt_1.book_id
            LEFT JOIN (SELECT book_id, 
                              AVG(rating) AS avg_rating
                       FROM ratings
                       GROUP BY book_id) AS cnt_2
            ON b.book_id = cnt_2.book_id
            GROUP BY b.title
            ) AS derived_table
        '''
pd.io.sql.read_sql(sql=text(total_reviews_query), con = con)

   total_reviews
0         2793.0

Вывод: больше всего обзоров у Twilight (Twilight #1)

3. Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;

In [10]:
query = '''SELECT pb.publisher
           FROM books b
           JOIN publishers pb ON b.publisher_id = pb.publisher_id
           WHERE b.num_pages > 50
           GROUP BY pb.publisher
           ORDER BY COUNT(b.book_id) DESC
           LIMIT 1
        '''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

       publisher
0  Penguin Books

Вывод: издательство, которое выпустило наибольшее число книг толще 50 страниц - Penguin Books

4. Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;

In [11]:
query = '''SELECT a.author,
                  ROUND(AVG(ra.rating),2)
           FROM books b
           JOIN authors a ON b.author_id = a.author_id
           JOIN ratings ra ON b.book_id = ra.book_id
           GROUP BY a.author
           HAVING COUNT(ra.rating_id) > 50
           ORDER BY AVG(ra.rating) DESC
           LIMIT 1
        '''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

                       author  round
0  J.K. Rowling/Mary GrandPré   4.29

Вывод: автора с самой высокой средней оценкой книг J.K. Rowling/Mary GrandPré

5. Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

In [12]:
query = '''SELECT AVG(review_count) as average_reviews
           FROM 
               (
                SELECT r.username, COUNT(distinct r.review_id) as review_count
                FROM reviews r
                WHERE r.username IN (
                          SELECT ra.username
                          FROM ratings ra
                          GROUP BY ra.username
                          HAVING COUNT(ra.rating_id) > 48
                                      )
                GROUP BY r.username
              ) sub;
        '''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

   average_reviews
0             24.0

Вывод: среднее количество обзоров от пользователей, которые поставили больше 48 оценок - 24